import pandas as pd
from Base_ETL import BaseETL

class Comorbidity02_01(BaseETL):

    def run(
        self,
    ):
        df = pd.DataFrame()
        DM_ID= [179923692163948499213415563049065666099
                ,100013673100494458
                ,124544982552535259606612151483555844118
                ,311516731123113998083293947576762463176
                ,180477226589075792783410850701692332152
                ,241818195048918956410972430839941793797
                ,112781230063226097305393137577567266702
                ,182502328884662550188506631068055331386
                ,35199582347749599074339928632598681396
                ,38574577788699984521358364964354879154
                ,191434064415123060368169915072635505895
                ,20675406788528784872954340882617011889
                ,124544982552535259606612151483555844118
                ,100541754
                ,5636289410815244976929549021967161760
                ,257622349486994503306442097666053247857
                ,28717150497080197412666542997673838333
                ,335129587711688698123326547937165516375
                ,216368654538664928771607781485869688362
                ,130472481221961248719063246270002851492
                ,218640080165093703318684389459080981822
                ,26376779040471720355380088792025144185
                ,290305680413187966621776517303400818013
                ,100466730
                ,100739416
                ,100040660
                ,100640216
                ,334240307575660533726147819949656813277
                ,100037099
                ,100180457
                ,100414623
                ,100397416
                ,100494458
                ,100517762
                ,100313494
                ,100630822
                ]
        
        for x in DM_ID:
            sql = '''
                SELECT 
                    환자번호 as ID,
                    의무기록작성일 as DM_Date,
                    `의무기록 환자진료과코드` as DM_MD_1,
                    `의무기록 환자진료과` as DM_MD_2,
                    case
                    when
                    진료서식구성원소ID = '{0}'
                    then case
                        when (instr(의무기록내용,'+')) != 0 then '+'
                        when (instr(의무기록내용,'-')) != 0 then '-'
                        when (instr(의무기록내용,'1')) != 0 then '+'
                        when (instr(의무기록내용,'yes')) != 0 then '+'
                        when (instr(의무기록내용,'no')) != 0 then '-'
                        end
                    end as DM

                FROM 
                    gc_raw_test.outpatient
                WHERE 
                    진료서식구성원소ID = '{0}'
            ''' .format(x)    
            data = self.df_from_sql(db_name="gc_raw_test", sql=sql)
            df = pd.concat([df,data],axis = 0, sort=False) 
        df = df.sort_values(['ID','DM_Date'])
        df = df.reset_index(drop= True)
        self.insert(df, db_name="gc_protocol_test", tb_name="tb_tmp_comorbidity_02_00") 
        

if __name__ == "__main__":
    obj = Comorbidity02_01()
    obj.run()